Desktop/Notify/app/views/profiles/myAccount.html.erb

SELECT "circles".* FROM "circles" WHERE "circles"."user_id" = 1
SELECT 1 AS one FROM "circles" WHERE "circles"."user_id" = 1 AND "circles"."name" = 'twitter' LIMIT 1
---

			      		<% if(@user.circles.exists?(:name => "twitter")&&Circle.exists?(:name => "googlePlus")) %>