app/controllers/circles_controller.rb

SELECT "circles".* FROM "circles" WHERE "circles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT 1 AS one FROM "circles" WHERE "circles"."user_id" = 1 AND "circles"."id" = 1 LIMIT 1
---
  def show
  	@user = current_user

  	if (Circle.exists?(params[:id]))
  		@circle = Circle.find(params[:id])
  		unless(@user.circles.exists?(@circle))