app/controllers/facebook_controller.rb

SELECT 1 AS one FROM "circles" WHERE "circles"."user_id" = 1 AND "circles"."name" = 'facebook' LIMIT 1
INSERT INTO "circles" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 04 May 2015 22:06:57 UTC +00:00], ["name", "facebook"], ["updated_at", Mon, 04 May 2015 22:06:57 UTC +00:00], ["user_id", 1]]
SELECT "users".* FROM "users" WHERE (uid LIKE '10155444750630635')
---
   def create

    @user = current_user
    @fb_friends = FbGraph::User.me(env["omniauth.auth"].credentials.token).friends
    @graph = Koala::Facebook::API.new(env["omniauth.auth"].credentials.token)
    profile = @graph.get_object("me")
    friends = @graph.get_connections("me", "friends")
    @user.name = env["omniauth.auth"].info.name
    @user.provider = env["omniauth.auth"].provider
    @user.uid = env["omniauth.auth"].uid
    @user.fb_email = env["omniauth.auth"].info.email

    @user.gender = env["omniauth.auth"].extra.raw_info.gender
    @user.faceboook_profileimage=env["omniauth.auth"].info.image
    @user.oauth_token = env["omniauth.auth"].credentials.token

    # Check that circles if the facebook circles already exists and if not create a new one.
    # The variables :fbCircle => facebook circle.

    unless(@user.circles.exists?(:name => "facebook"))
          fbCircle = Circle.new
          fbCircle.user_id = current_user.id
          fbCircle.name = "facebook"
          fbCircle.save

    else
          fbCircle = @user.circles.where("name = 'facebook'")
    end

# Insert a list of friends in the facebook circles.
# The variables : fbFriend.
    friends.each do |f|

INSERT INTO "friends" ("circle_id", "created_at", "fb_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["circle_id", 1], ["created_at", Mon, 04 May 2015 22:06:57 UTC +00:00], ["fb_id", 10155444750630635], ["name", "Samira Negm"], ["updated_at", Mon, 04 May 2015 22:06:57 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
        fbFriend.circle_id = fbCircle.id
        fbFriend.name = f["name"]
        fbFriend.fb_id = f["id"]
        fbFriend.save
    end
        friendUser = User.find(:all, :conditions => ['uid LIKE ?' , f["id"]])