app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE (notified LIKE 1)
---
def index
	 @id=current_user.id
	 @notifications=Notification.find(:all,:conditions => ['notified LIKE ?', @id])