app/controllers/places_controller.rb

	def create
		@places = []
		@visits = Visit.find(:all, :conditions => ['user_id LIKE ?' , current_user.id])
		@visits.each do |v|
			place = Place.find(:all, :conditions => ['id LIKE ?' , v.place_id])
---
SELECT "visits".* FROM "visits" WHERE (user_id LIKE 1)
SELECT "places".* FROM "places" WHERE (id LIKE 1)

    def show
   	 	@id = params[:id]
    	if (Place.exists?(@id))
      		@place = Place.find(@id)
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]