app/controllers/profiles_controller.rb

SELECT "requests".* FROM "requests" WHERE (destination LIKE NULL)
---
  def myAccount
# Getting the current login user to retrieve all the info in the profile page
      unless(current_user == nil)
          @user = current_user
          if(@user.uid==nil)
            redirect_to "/auth/facebook" and return
          end
          unless(params[:search==nil])
            @requests = Request.search params[:search]

UPDATE "users" SET "verification" = 't', "updated_at" = '2015-05-07 14:38:48.067944' WHERE "users"."id" = 1
---
  def verifyMe
    #redirect_to url_for(:controller => "profiles", :action => "new")
    #redirect_to url_for(:controller => "profiles", :action => "myAccount") and return
    @user = current_user
    @user.verification = true
    @user.save