app/controllers/requests_controller.rb

  def show
    @user = current_user
    @id = params[:id]
    if (Request.exists?(@id))
      @request = Request.find(@id)
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]

  def create_ride_info
    @color = params[:car_color]
    @model = params[:car_model]
    @number = params[:car_number]
    @seats = params[:seats]
    @smoking = params[:smoking]
    @air_conditioner = params[:air_conditioner]
    @trunk = params[:trunk]
    @name = params[:name]
    @@request.car_color = @color
    @@request.car_model= @model
    @@request.car_number= @number
    @@request.seats= @seats
    @@request.smoking= @smoking
    @@request.air_conditioner= @air_conditioner
    @@request.trunk= @trunk
    @@request.name= @name
    @@request.save
---
INSERT INTO "requests" ("air_conditioner", "car_color", "car_model", "car_number", "created_at", "currentLoc", "destination", "lat_curr", "lat_destination", "long_curr", "long_destination", "name", "seats", "smoking", "trunk", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)