app/controllers/tags_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE 'renad ')
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "tags" ("created_at", "current_user", "request_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 04 May 2015 22:09:39 UTC +00:00], ["current_user", 1], ["request_id", 1], ["updated_at", Mon, 04 May 2015 22:09:39 UTC +00:00], ["user_id", nil]]
INSERT INTO "notifications" ("created_at", "notified", "notifying", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 04 May 2015 22:09:39 UTC +00:00], ["notified", nil], ["notifying", 1], ["text", nil], ["updated_at", Mon, 04 May 2015 22:09:39 UTC +00:00]]
---
	def create
	  unless(params[:id]==nil)
		@id=current_user.id
		@tag=Tag.new
		@not=Notification.new
		 unless(params[:tagList]==nil)
		   @tag.request_id=params[:id]
		   @tag.current_user=@id
		   @not.notifying=@id

		   usernames = params[:tagList].split(/,/)
		      usernames.each do |grant|
		      	@users=User.find(:all,:conditions =>['username LIKE ?', grant])
		      	@request=Request.find(params[:id])
		      	  @users.each do |user|
				   @tag.user_id=user.id
				   @not.notified=user.id
				   @not.text=grant +" has tagged you in" + @request.name
				  end
			  end
	     end
     end
@tag.save
@not.save