app/controllers/trips_controller.rb

def create
	unless(params[:id==nil])
		  @id = current_user.id
		  @@trip.user_id = @id
		  @@trip.request_id= params[:id]
		  unless(params[:id] == nil)
		    @request=Request.find(params[:id])
		    @owner = User.find(@request.user_id)
		    @user = current_user
		    @points = calc(@request.distance)
		    @owner.budget = @owner.budget + @points
		    @user.budget = @user.budget - @points

		  	if(@request.seats>0 and @user.budget>=@points)
		  	 @request.seats=@request.seats - 1
		  	 @request.save
		  	 @owner.save
		  	 @user.save
		 	 @@trip.save
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "requests" SET "seats" = 2, "updated_at" = '2015-05-05 14:33:42.220800' WHERE "requests"."id" = 1
INSERT INTO "trips" ("created_at", "request_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 05 May 2015 14:33:42 UTC +00:00], ["request_id", 1], ["updated_at", Tue, 05 May 2015 14:33:42 UTC +00:00], ["user_id", 1]]