app/views/circles/show.html.erb

SELECT "friends".* FROM "friends" WHERE "friends"."circle_id" = 1
---
<h4> Friends in the circle :- </h4><br>
		<% @circle.friends.each do |c| %>

SELECT 1 AS one FROM "users" WHERE "users"."fb_email" = 'MyString' LIMIT 1
---
			<% if(@circle.name=='facebook') %>
				<% if User.exists?(:fb_email=> c.name)  %>

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	                  <% @circle.friends.each do |c| %>
	                  	<% @user = User.find(c.app_id) %>